contiki-os/contiki/cpu/rl78/sfrs.h
/*
 * Copyright (c) 2014, Analog Devices, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
 * OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/**
 * \author Ian Martin <martini@redwirellc.com>
 */

#ifndef SFRS_H
#define SFRS_H

#define P0       (*(volatile unsigned char *)0xFFF00)
#define P1       (*(volatile unsigned char *)0xFFF01)
#define P2       (*(volatile unsigned char *)0xFFF02)
#define P3       (*(volatile unsigned char *)0xFFF03)
#define P4       (*(volatile unsigned char *)0xFFF04)
#define P5       (*(volatile unsigned char *)0xFFF05)
#define P6       (*(volatile unsigned char *)0xFFF06)
#define P7       (*(volatile unsigned char *)0xFFF07)
#define P8       (*(volatile unsigned char *)0xFFF08)
#define P9       (*(volatile unsigned char *)0xFFF09)
#define P10      (*(volatile unsigned char *)0xFFF0A)
#define P11      (*(volatile unsigned char *)0xFFF0B)
#define P12      (*(volatile unsigned char *)0xFFF0C)
#define P13      (*(volatile unsigned char *)0xFFF0D)
#define P14      (*(volatile unsigned char *)0xFFF0E)
#define P15      (*(volatile unsigned char *)0xFFF0F)
#define SDR00    (*(volatile unsigned short *)0xFFF10)
#define SIO00    (*(volatile unsigned char *)0xFFF10)
#define TXD0     (*(volatile unsigned char *)0xFFF10)
#define SDR01    (*(volatile unsigned short *)0xFFF12)
#define RXD0     (*(volatile unsigned char *)0xFFF12)
#define SIO01    (*(volatile unsigned char *)0xFFF12)
#define SDR12    (*(volatile unsigned short *)0xFFF14)
#define SIO30    (*(volatile unsigned char *)0xFFF14)
#define TXD3     (*(volatile unsigned char *)0xFFF14)
#define SDR13    (*(volatile unsigned short *)0xFFF16)
#define RXD3     (*(volatile unsigned char *)0xFFF16)
#define SIO31    (*(volatile unsigned char *)0xFFF16)
#define TDR00    (*(volatile unsigned short *)0xFFF18)
#define TDR01    (*(volatile unsigned short *)0xFFF1A)
#define TDR01L   (*(volatile unsigned char *)0xFFF1A)
#define TDR01H   (*(volatile unsigned char *)0xFFF1B)
#define ADCR     (*(volatile unsigned short *)0xFFF1E)
#define ADCRH    (*(volatile unsigned char *)0xFFF1F)
#define PM0      (*(volatile unsigned char *)0xFFF20)
#define PM1      (*(volatile unsigned char *)0xFFF21)
#define PM2      (*(volatile unsigned char *)0xFFF22)
#define PM3      (*(volatile unsigned char *)0xFFF23)
#define PM4      (*(volatile unsigned char *)0xFFF24)
#define PM5      (*(volatile unsigned char *)0xFFF25)
#define PM6      (*(volatile unsigned char *)0xFFF26)
#define PM7      (*(volatile unsigned char *)0xFFF27)
#define PM8      (*(volatile unsigned char *)0xFFF28)
#define PM9      (*(volatile unsigned char *)0xFFF29)
#define PM10     (*(volatile unsigned char *)0xFFF2A)
#define PM11     (*(volatile unsigned char *)0xFFF2B)
#define PM12     (*(volatile unsigned char *)0xFFF2C)
#define PM14     (*(volatile unsigned char *)0xFFF2E)
#define PM15     (*(volatile unsigned char *)0xFFF2F)
#define ADM0     (*(volatile unsigned char *)0xFFF30)
#define ADS      (*(volatile unsigned char *)0xFFF31)
#define ADM1     (*(volatile unsigned char *)0xFFF32)
#define KRM      (*(volatile unsigned char *)0xFFF37)
#define EGP0     (*(volatile unsigned char *)0xFFF38)
#define EGN0     (*(volatile unsigned char *)0xFFF39)
#define EGP1     (*(volatile unsigned char *)0xFFF3A)
#define EGN1     (*(volatile unsigned char *)0xFFF3B)
#define SDR02    (*(volatile unsigned short *)0xFFF44)
#define SIO10    (*(volatile unsigned char *)0xFFF44)
#define TXD1     (*(volatile unsigned char *)0xFFF44)
#define SDR03    (*(volatile unsigned short *)0xFFF46)
#define RXD1     (*(volatile unsigned char *)0xFFF46)
#define SIO11    (*(volatile unsigned char *)0xFFF46)
#define SDR10    (*(volatile unsigned short *)0xFFF48)
#define SIO20    (*(volatile unsigned char *)0xFFF48)
#define TXD2     (*(volatile unsigned char *)0xFFF48)
#define SDR11    (*(volatile unsigned short *)0xFFF4A)
#define RXD2     (*(volatile unsigned char *)0xFFF4A)
#define SIO21    (*(volatile unsigned char *)0xFFF4A)
#define IICA0    (*(volatile unsigned char *)0xFFF50)
#define IICS0    (*(volatile unsigned char *)0xFFF51)
#define IICF0    (*(volatile unsigned char *)0xFFF52)
#define IICA1    (*(volatile unsigned char *)0xFFF54)
#define IICS1    (*(volatile unsigned char *)0xFFF55)
#define IICF1    (*(volatile unsigned char *)0xFFF56)
#define TDR02    (*(volatile unsigned short *)0xFFF64)
#define TDR03    (*(volatile unsigned short *)0xFFF66)
#define TDR03L   (*(volatile unsigned char *)0xFFF66)
#define TDR03H   (*(volatile unsigned char *)0xFFF67)
#define TDR04    (*(volatile unsigned short *)0xFFF68)
#define TDR05    (*(volatile unsigned short *)0xFFF6A)
#define TDR06    (*(volatile unsigned short *)0xFFF6C)
#define TDR07    (*(volatile unsigned short *)0xFFF6E)
#define TDR10    (*(volatile unsigned short *)0xFFF70)
#define TDR11    (*(volatile unsigned short *)0xFFF72)
#define TDR11L   (*(volatile unsigned char *)0xFFF72)
#define TDR11H   (*(volatile unsigned char *)0xFFF73)
#define TDR12    (*(volatile unsigned short *)0xFFF74)
#define TDR13    (*(volatile unsigned short *)0xFFF76)
#define TDR13L   (*(volatile unsigned char *)0xFFF76)
#define TDR13H   (*(volatile unsigned char *)0xFFF77)
#define TDR14    (*(volatile unsigned short *)0xFFF78)
#define TDR15    (*(volatile unsigned short *)0xFFF7A)
#define TDR16    (*(volatile unsigned short *)0xFFF7C)
#define TDR17    (*(volatile unsigned short *)0xFFF7E)
#define FLPMC    (*(volatile unsigned char *)0xFFF80)
#define FLARS    (*(volatile unsigned char *)0xFFF81)
#define FLAPL    (*(volatile unsigned short *)0xFFF82)
#define FLAPH    (*(volatile unsigned char *)0xFFF84)
#define FSSQ     (*(volatile unsigned char *)0xFFF85)
#define FLSEDL   (*(volatile unsigned short *)0xFFF86)
#define FLSEDH   (*(volatile unsigned char *)0xFFF88)
#define FLRST    (*(volatile unsigned char *)0xFFF89)
#define FSASTL   (*(volatile unsigned char *)0xFFF8A)
#define FSASTH   (*(volatile unsigned char *)0xFFF8B)
#define FLWL     (*(volatile unsigned short *)0xFFF8C)
#define FLWH     (*(volatile unsigned short *)0xFFF8E)
#define ITMC     (*(volatile unsigned short *)0xFFF90)
#define SEC      (*(volatile unsigned char *)0xFFF92)
#define RL78_MIN (*(volatile unsigned char *)0xFFF93)  /* Note: "MIN" would conflict with the MIN() macro. */
#define HOUR     (*(volatile unsigned char *)0xFFF94)
#define WEEK     (*(volatile unsigned char *)0xFFF95)
#define DAY      (*(volatile unsigned char *)0xFFF96)
#define MONTH    (*(volatile unsigned char *)0xFFF97)
#define YEAR     (*(volatile unsigned char *)0xFFF98)
#define SUBCUD   (*(volatile unsigned char *)0xFFF99)
#define ALARMWM  (*(volatile unsigned char *)0xFFF9A)
#define ALARMWH  (*(volatile unsigned char *)0xFFF9B)
#define ALARMWW  (*(volatile unsigned char *)0xFFF9C)
#define RTCC0    (*(volatile unsigned char *)0xFFF9D)
#define RTCC1    (*(volatile unsigned char *)0xFFF9E)
#define CMC      (*(volatile unsigned char *)0xFFFA0)
#define CSC      (*(volatile unsigned char *)0xFFFA1)
#define OSTC     (*(volatile unsigned char *)0xFFFA2)
#define OSTS     (*(volatile unsigned char *)0xFFFA3)
#define CKC      (*(volatile unsigned char *)0xFFFA4)
#define CKS0     (*(volatile unsigned char *)0xFFFA5)
#define CKS1     (*(volatile unsigned char *)0xFFFA6)
#define RESF     (*(volatile unsigned char *)0xFFFA8)
#define LVIM     (*(volatile unsigned char *)0xFFFA9)
#define LVIS     (*(volatile unsigned char *)0xFFFAA)
#define WDTE     (*(volatile unsigned char *)0xFFFAB)
#define CRCIN    (*(volatile unsigned char *)0xFFFAC)
#define RXB      (*(volatile unsigned char *)0xFFFAD)
#define TXS      (*(volatile unsigned char *)0xFFFAD)
#define MONSTA0  (*(volatile unsigned char *)0xFFFAE)
#define ASIM     (*(volatile unsigned char *)0xFFFAF)
#define DSA0     (*(volatile unsigned char *)0xFFFB0)
#define DSA1     (*(volatile unsigned char *)0xFFFB1)
#define DRA0     (*(volatile unsigned short *)0xFFFB2)
#define DRA0L    (*(volatile unsigned char *)0xFFFB2)
#define DRA0H    (*(volatile unsigned char *)0xFFFB3)
#define DRA1     (*(volatile unsigned short *)0xFFFB4)
#define DRA1L    (*(volatile unsigned char *)0xFFFB4)
#define DRA1H    (*(volatile unsigned char *)0xFFFB5)
#define DBC0     (*(volatile unsigned short *)0xFFFB6)
#define DBC0L    (*(volatile unsigned char *)0xFFFB6)
#define DBC0H    (*(volatile unsigned char *)0xFFFB7)
#define DBC1     (*(volatile unsigned short *)0xFFFB8)
#define DBC1L    (*(volatile unsigned char *)0xFFFB8)
#define DBC1H    (*(volatile unsigned char *)0xFFFB9)
#define DMC0     (*(volatile unsigned char *)0xFFFBA)
#define DMC1     (*(volatile unsigned char *)0xFFFBB)
#define DRC0     (*(volatile unsigned char *)0xFFFBC)
#define DRC1     (*(volatile unsigned char *)0xFFFBD)
#define IF2      (*(volatile unsigned short *)0xFFFD0)
#define IF2L     (*(volatile unsigned char *)0xFFFD0)
#define IF2H     (*(volatile unsigned char *)0xFFFD1)
#define IF3      (*(volatile unsigned short *)0xFFFD2)
#define IF3L     (*(volatile unsigned char *)0xFFFD2)
#define MK2      (*(volatile unsigned short *)0xFFFD4)
#define MK2L     (*(volatile unsigned char *)0xFFFD4)
#define MK2H     (*(volatile unsigned char *)0xFFFD5)
#define MK3      (*(volatile unsigned short *)0xFFFD6)
#define MK3L     (*(volatile unsigned char *)0xFFFD6)
#define PR02     (*(volatile unsigned short *)0xFFFD8)
#define PR02L    (*(volatile unsigned char *)0xFFFD8)
#define PR02H    (*(volatile unsigned char *)0xFFFD9)
#define PR03     (*(volatile unsigned short *)0xFFFDA)
#define PR03L    (*(volatile unsigned char *)0xFFFDA)
#define PR12     (*(volatile unsigned short *)0xFFFDC)
#define PR12L    (*(volatile unsigned char *)0xFFFDC)
#define PR12H    (*(volatile unsigned char *)0xFFFDD)
#define PR13     (*(volatile unsigned short *)0xFFFDE)
#define PR13L    (*(volatile unsigned char *)0xFFFDE)
#define IF0      (*(volatile unsigned short *)0xFFFE0)
#define IF0L     (*(volatile unsigned char *)0xFFFE0)
#define IF0H     (*(volatile unsigned char *)0xFFFE1)
#define IF1      (*(volatile unsigned short *)0xFFFE2)
#define IF1L     (*(volatile unsigned char *)0xFFFE2)
#define IF1H     (*(volatile unsigned char *)0xFFFE3)
#define MK0      (*(volatile unsigned short *)0xFFFE4)
#define MK0L     (*(volatile unsigned char *)0xFFFE4)
#define MK0H     (*(volatile unsigned char *)0xFFFE5)
#define MK1      (*(volatile unsigned short *)0xFFFE6)
#define MK1L     (*(volatile unsigned char *)0xFFFE6)
#define MK1H     (*(volatile unsigned char *)0xFFFE7)
#define PR00     (*(volatile unsigned short *)0xFFFE8)
#define PR00L    (*(volatile unsigned char *)0xFFFE8)
#define PR00H    (*(volatile unsigned char *)0xFFFE9)
#define PR01     (*(volatile unsigned short *)0xFFFEA)
#define PR01L    (*(volatile unsigned char *)0xFFFEA)
#define PR01H    (*(volatile unsigned char *)0xFFFEB)
#define PR10     (*(volatile unsigned short *)0xFFFEC)
#define PR10L    (*(volatile unsigned char *)0xFFFEC)
#define PR10H    (*(volatile unsigned char *)0xFFFED)
#define PR11     (*(volatile unsigned short *)0xFFFEE)
#define PR11L    (*(volatile unsigned char *)0xFFFEE)
#define PR11H    (*(volatile unsigned char *)0xFFFEF)
#define MDAL     (*(volatile unsigned short *)0xFFFF0)
#define MULA     (*(volatile unsigned short *)0xFFFF0)
#define MDAH     (*(volatile unsigned short *)0xFFFF2)
#define MULB     (*(volatile unsigned short *)0xFFFF2)
#define MDBH     (*(volatile unsigned short *)0xFFFF4)
#define MULOH    (*(volatile unsigned short *)0xFFFF4)
#define MDBL     (*(volatile unsigned short *)0xFFFF6)
#define MULOL    (*(volatile unsigned short *)0xFFFF6)
#define PMC      (*(volatile unsigned char *)0xFFFFE)

struct P0struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct P1struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

