contiki-os/contiki/cpu/rl78/sfrs.h
struct P2struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct P3struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct P4struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct P5struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct P6struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct P7struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct P8struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct P9struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct P10struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct P11struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct P12struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct P13struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct P14struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct P15struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct SDR00struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct SIO00struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct TXD0struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct SDR01struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct RXD0struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct SIO01struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct SDR12struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct SIO30struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct TXD3struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

