contiki-os/contiki/cpu/rl78/sfrs.h
struct EGN0struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct EGP1struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct EGN1struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct SDR02struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct SIO10struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct TXD1struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct SDR03struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct RXD1struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct SIO11struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct SDR10struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct SIO20struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct TXD2struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct SDR11struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct RXD2struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct SIO21struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct IICA0struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct IICS0struct {
  unsigned char spd0      : 1;
  unsigned char std0      : 1;
  unsigned char ackd0     : 1;
  unsigned char trc0      : 1;
  unsigned char coi0      : 1;
  unsigned char exc0      : 1;
  unsigned char ald0      : 1;
  unsigned char msts0     : 1;
};

struct IICF0struct {
  unsigned char iicrsv0   : 1;
  unsigned char stcen0    : 1;
  unsigned char : 1;
  unsigned char iicbsy0   : 1;
  unsigned char stcf0     : 1;
};

struct IICA1struct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct IICS1struct {
  unsigned char spd1      : 1;
  unsigned char std1      : 1;
  unsigned char ackd1     : 1;
  unsigned char trc1      : 1;
  unsigned char coi1      : 1;
  unsigned char exc1      : 1;
  unsigned char ald1      : 1;
  unsigned char msts1     : 1;
};

struct IICF1struct {
  unsigned char iicrsv1   : 1;
  unsigned char stcen1    : 1;
  unsigned char : 1;
  unsigned char iicbsy1   : 1;
  unsigned char stcf1     : 1;
};

struct TDR02struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct TDR03struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct TDR03Lstruct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct TDR03Hstruct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct TDR04struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

