contiki-os/contiki/cpu/rl78/sfrs.h
struct TDR05struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct TDR06struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct TDR07struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct TDR10struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct TDR11struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct TDR11Lstruct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct TDR11Hstruct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct TDR12struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct TDR13struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct TDR13Lstruct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct TDR13Hstruct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct TDR14struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct TDR15struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct TDR16struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

