contiki-os/contiki/cpu/rl78/sfrs.h
struct DRA1struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct DRA1Lstruct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct DRA1Hstruct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct DBC0struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct DBC0Lstruct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct DBC0Hstruct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct DBC1struct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct DBC1Lstruct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct DBC1Hstruct {
  unsigned char bit0      : 1;
  unsigned char bit1      : 1;
  unsigned char bit2      : 1;
  unsigned char bit3      : 1;
  unsigned char bit4      : 1;
  unsigned char bit5      : 1;
  unsigned char bit6      : 1;
  unsigned char bit7      : 1;
};

struct DMC0struct {
  unsigned char : 1;
  unsigned char dwait0    : 1;
  unsigned char ds0       : 1;
  unsigned char drs0      : 1;
  unsigned char stg0      : 1;
};

struct DMC1struct {
  unsigned char : 1;
  unsigned char dwait1    : 1;
  unsigned char ds1       : 1;
  unsigned char drs1      : 1;
  unsigned char stg1      : 1;
};

struct DRC0struct {
  unsigned char dst0      : 1;
  unsigned char : 1;
  unsigned char den0      : 1;
};

struct DRC1struct {
  unsigned char dst1      : 1;
  unsigned char : 1;
  unsigned char den1      : 1;
};

struct IF2struct {
  unsigned short tmif05    : 1;
  unsigned short tmif06    : 1;
  unsigned short tmif07    : 1;
  unsigned short pif6      : 1;
  unsigned short pif7      : 1;
  unsigned short pif8      : 1;
  unsigned short pif9      : 1;
  unsigned short pif10     : 1;
};

struct IF2Lstruct {
  unsigned char tmif05    : 1;
  unsigned char tmif06    : 1;
  unsigned char tmif07    : 1;
  unsigned char pif6      : 1;
  unsigned char pif7      : 1;
  unsigned char pif8      : 1;
  unsigned char pif9      : 1;
  unsigned char pif10     : 1;
};

struct IF2Hstruct {
  unsigned char pif11     : 1;
  unsigned char tmif10    : 1;
  unsigned char tmif11    : 1;
  unsigned char tmif12    : 1;
  unsigned char tmif13h   : 1;
  unsigned char mdif      : 1;
  unsigned char iicaif1   : 1;
  unsigned char flif      : 1;
};

struct IF3struct {
  unsigned short dmaif2    : 1;
  unsigned short dmaif3    : 1;
  unsigned short tmif14    : 1;
  unsigned short tmif15    : 1;
  unsigned short tmif16    : 1;
  unsigned short tmif17    : 1;
};

struct IF3Lstruct {
  unsigned char dmaif2    : 1;
  unsigned char dmaif3    : 1;
  unsigned char tmif14    : 1;
  unsigned char tmif15    : 1;
  unsigned char tmif16    : 1;
  unsigned char tmif17    : 1;
};

struct MK2struct {
  unsigned short tmmk05    : 1;
  unsigned short tmmk06    : 1;
  unsigned short tmmk07    : 1;
  unsigned short pmk6      : 1;
  unsigned short pmk7      : 1;
  unsigned short pmk8      : 1;
  unsigned short pmk9      : 1;
  unsigned short pmk10     : 1;
};

struct MK2Lstruct {
  unsigned char tmmk05    : 1;
  unsigned char tmmk06    : 1;
  unsigned char tmmk07    : 1;
  unsigned char pmk6      : 1;
  unsigned char pmk7      : 1;
  unsigned char pmk8      : 1;
  unsigned char pmk9      : 1;
  unsigned char pmk10     : 1;
};

struct MK2Hstruct {
  unsigned char pmk11     : 1;
  unsigned char tmmk10    : 1;
  unsigned char tmmk11    : 1;
  unsigned char tmmk12    : 1;
  unsigned char tmmk13h   : 1;
  unsigned char mdmk      : 1;
  unsigned char iicamk1   : 1;
  unsigned char flmk      : 1;
};

struct MK3struct {
  unsigned short dmamk2    : 1;
  unsigned short dmamk3    : 1;
  unsigned short tmmk14    : 1;
  unsigned short tmmk15    : 1;
  unsigned short tmmk16    : 1;
  unsigned short tmmk17    : 1;
};

