contiki-os/contiki/cpu/rl78/sfrs.h
struct MK3Lstruct {
  unsigned char dmamk2    : 1;
  unsigned char dmamk3    : 1;
  unsigned char tmmk14    : 1;
  unsigned char tmmk15    : 1;
  unsigned char tmmk16    : 1;
  unsigned char tmmk17    : 1;
};

struct PR02struct {
  unsigned short tmpr005   : 1;
  unsigned short tmpr006   : 1;
  unsigned short tmpr007   : 1;
  unsigned short ppr06     : 1;
  unsigned short ppr07     : 1;
  unsigned short ppr08     : 1;
  unsigned short ppr09     : 1;
  unsigned short ppr010    : 1;
};

struct PR02Lstruct {
  unsigned char tmpr005   : 1;
  unsigned char tmpr006   : 1;
  unsigned char tmpr007   : 1;
  unsigned char ppr06     : 1;
  unsigned char ppr07     : 1;
  unsigned char ppr08     : 1;
  unsigned char ppr09     : 1;
  unsigned char ppr010    : 1;
};

struct PR02Hstruct {
  unsigned char ppr011    : 1;
  unsigned char tmpr010   : 1;
  unsigned char tmpr011   : 1;
  unsigned char tmpr012   : 1;
  unsigned char tmpr013h  : 1;
  unsigned char mdpr0     : 1;
  unsigned char iicapr01  : 1;
  unsigned char flpr0     : 1;
};

struct PR03struct {
  unsigned short dmapr02   : 1;
  unsigned short dmapr03   : 1;
  unsigned short tmpr014   : 1;
  unsigned short tmpr015   : 1;
  unsigned short tmpr016   : 1;
  unsigned short tmpr017   : 1;
};

struct PR03Lstruct {
  unsigned char dmapr02   : 1;
  unsigned char dmapr03   : 1;
  unsigned char tmpr014   : 1;
  unsigned char tmpr015   : 1;
  unsigned char tmpr016   : 1;
  unsigned char tmpr017   : 1;
};

struct PR12struct {
  unsigned short tmpr105   : 1;
  unsigned short tmpr106   : 1;
  unsigned short tmpr107   : 1;
  unsigned short ppr16     : 1;
  unsigned short ppr17     : 1;
  unsigned short ppr18     : 1;
  unsigned short ppr19     : 1;
  unsigned short ppr110    : 1;
};

struct PR12Lstruct {
  unsigned char tmpr105   : 1;
  unsigned char tmpr106   : 1;
  unsigned char tmpr107   : 1;
  unsigned char ppr16     : 1;
  unsigned char ppr17     : 1;
  unsigned char ppr18     : 1;
  unsigned char ppr19     : 1;
  unsigned char ppr110    : 1;
};

struct PR12Hstruct {
  unsigned char ppr111    : 1;
  unsigned char tmpr110   : 1;
  unsigned char tmpr111   : 1;
  unsigned char tmpr112   : 1;
  unsigned char tmpr113h  : 1;
  unsigned char mdpr1     : 1;
  unsigned char iicapr11  : 1;
  unsigned char flpr1     : 1;
};

struct PR13struct {
  unsigned short dmapr12   : 1;
  unsigned short dmapr13   : 1;
  unsigned short tmpr114   : 1;
  unsigned short tmpr115   : 1;
  unsigned short tmpr116   : 1;
  unsigned short tmpr117   : 1;
};

struct PR13Lstruct {
  unsigned char dmapr12   : 1;
  unsigned char dmapr13   : 1;
  unsigned char tmpr114   : 1;
  unsigned char tmpr115   : 1;
  unsigned char tmpr116   : 1;
  unsigned char tmpr117   : 1;
};

struct IF0struct {
  unsigned short wdtiif    : 1;
  unsigned short lviif     : 1;
  unsigned short pif0      : 1;
  unsigned short pif1      : 1;
  unsigned short pif2      : 1;
  unsigned short pif3      : 1;
  unsigned short pif4      : 1;
  unsigned short pif5      : 1;
};

struct IF0Lstruct {
  unsigned char wdtiif    : 1;
  unsigned char lviif     : 1;
  unsigned char pif0      : 1;
  unsigned char pif1      : 1;
  unsigned char pif2      : 1;
  unsigned char pif3      : 1;
  unsigned char pif4      : 1;
  unsigned char pif5      : 1;
};

struct IF0Hstruct {
  unsigned char stif2     : 1;
  unsigned char srif2     : 1;
  unsigned char tmif11h   : 1;
  unsigned char dmaif0    : 1;
  unsigned char dmaif1    : 1;
  unsigned char stif0     : 1;
  unsigned char srif0     : 1;
  unsigned char tmif01h   : 1;
};

struct IF1struct {
  unsigned short stif1     : 1;
  unsigned short srif1     : 1;
  unsigned short tmif03h   : 1;
  unsigned short iicaif0   : 1;
  unsigned short tmif00    : 1;
  unsigned short tmif01    : 1;
  unsigned short tmif02    : 1;
  unsigned short tmif03    : 1;
};

struct IF1Lstruct {
  unsigned char stif1     : 1;
  unsigned char srif1     : 1;
  unsigned char tmif03h   : 1;
  unsigned char iicaif0   : 1;
  unsigned char tmif00    : 1;
  unsigned char tmif01    : 1;
  unsigned char tmif02    : 1;
  unsigned char tmif03    : 1;
};

struct IF1Hstruct {
  unsigned char adif      : 1;
  unsigned char rtcif     : 1;
  unsigned char itif      : 1;
  unsigned char krif      : 1;
  unsigned char stif3     : 1;
  unsigned char srif3     : 1;
  unsigned char tmif13    : 1;
  unsigned char tmif04    : 1;
};

struct MK0struct {
  unsigned short wdtimk    : 1;
  unsigned short lvimk     : 1;
  unsigned short pmk0      : 1;
  unsigned short pmk1      : 1;
  unsigned short pmk2      : 1;
  unsigned short pmk3      : 1;
  unsigned short pmk4      : 1;
  unsigned short pmk5      : 1;
};

struct MK0Lstruct {
  unsigned char wdtimk    : 1;
  unsigned char lvimk     : 1;
  unsigned char pmk0      : 1;
  unsigned char pmk1      : 1;
  unsigned char pmk2      : 1;
  unsigned char pmk3      : 1;
  unsigned char pmk4      : 1;
  unsigned char pmk5      : 1;
};

struct MK0Hstruct {
  unsigned char stmk2     : 1;
  unsigned char srmk2     : 1;
  unsigned char tmmk11h   : 1;
  unsigned char dmamk0    : 1;
  unsigned char dmamk1    : 1;
  unsigned char stmk0     : 1;
  unsigned char srmk0     : 1;
  unsigned char tmmk01h   : 1;
};

struct MK1struct {
  unsigned short stmk1     : 1;
  unsigned short srmk1     : 1;
  unsigned short tmmk03h   : 1;
  unsigned short iicamk0   : 1;
  unsigned short tmmk00    : 1;
  unsigned short tmmk01    : 1;
  unsigned short tmmk02    : 1;
  unsigned short tmmk03    : 1;
};

struct MK1Lstruct {
  unsigned char stmk1     : 1;
  unsigned char srmk1     : 1;
  unsigned char tmmk03h   : 1;
  unsigned char iicamk0   : 1;
  unsigned char tmmk00    : 1;
  unsigned char tmmk01    : 1;
  unsigned char tmmk02    : 1;
  unsigned char tmmk03    : 1;
};

struct MK1Hstruct {
  unsigned char admk      : 1;
  unsigned char rtcmk     : 1;
  unsigned char itmk      : 1;
  unsigned char krmk      : 1;
  unsigned char stmk3     : 1;
  unsigned char srmk3     : 1;
  unsigned char tmmk13    : 1;
  unsigned char tmmk04    : 1;
};

struct PR00struct {
  unsigned short wdtipr0   : 1;
  unsigned short lvipr0    : 1;
  unsigned short ppr00     : 1;
  unsigned short ppr01     : 1;
  unsigned short ppr02     : 1;
  unsigned short ppr03     : 1;
  unsigned short ppr04     : 1;
  unsigned short ppr05     : 1;
};

struct PR00Lstruct {
  unsigned char wdtipr0   : 1;
  unsigned char lvipr0    : 1;
  unsigned char ppr00     : 1;
  unsigned char ppr01     : 1;
  unsigned char ppr02     : 1;
  unsigned char ppr03     : 1;
  unsigned char ppr04     : 1;
  unsigned char ppr05     : 1;
};

struct PR00Hstruct {
  unsigned char stpr02    : 1;
  unsigned char srpr02    : 1;
  unsigned char tmpr011h  : 1;
  unsigned char dmapr00   : 1;
  unsigned char dmapr01   : 1;
  unsigned char stpr00    : 1;
  unsigned char srpr00    : 1;
  unsigned char tmpr001h  : 1;
};

struct PR01struct {
  unsigned short stpr01    : 1;
  unsigned short srpr01    : 1;
  unsigned short tmpr003h  : 1;
  unsigned short iicapr00  : 1;
  unsigned short tmpr000   : 1;
  unsigned short tmpr001   : 1;
  unsigned short tmpr002   : 1;
  unsigned short tmpr003   : 1;
};

struct PR01Lstruct {
  unsigned char stpr01    : 1;
  unsigned char srpr01    : 1;
  unsigned char tmpr003h  : 1;
  unsigned char iicapr00  : 1;
  unsigned char tmpr000   : 1;
  unsigned char tmpr001   : 1;
  unsigned char tmpr002   : 1;
  unsigned char tmpr003   : 1;
};

struct PR01Hstruct {
  unsigned char adpr0     : 1;
  unsigned char rtcpr0    : 1;
  unsigned char itpr0     : 1;
  unsigned char krpr0     : 1;
  unsigned char stpr03    : 1;
  unsigned char srpr03    : 1;
  unsigned char tmpr013   : 1;
  unsigned char tmpr004   : 1;
};

