contiki-os/contiki/cpu/rl78/sfrs.h
struct PR10struct {
  unsigned short wdtipr1   : 1;
  unsigned short lvipr1    : 1;
  unsigned short ppr10     : 1;
  unsigned short ppr11     : 1;
  unsigned short ppr12     : 1;
  unsigned short ppr13     : 1;
  unsigned short ppr14     : 1;
  unsigned short ppr15     : 1;
};

struct PR10Lstruct {
  unsigned char wdtipr1   : 1;
  unsigned char lvipr1    : 1;
  unsigned char ppr10     : 1;
  unsigned char ppr11     : 1;
  unsigned char ppr12     : 1;
  unsigned char ppr13     : 1;
  unsigned char ppr14     : 1;
  unsigned char ppr15     : 1;
};

struct PR10Hstruct {
  unsigned char stpr12    : 1;
  unsigned char srpr12    : 1;
  unsigned char tmpr111h  : 1;
  unsigned char dmapr10   : 1;
  unsigned char dmapr11   : 1;
  unsigned char stpr10    : 1;
  unsigned char srpr10    : 1;
  unsigned char tmpr101h  : 1;
};

struct PR11struct {
  unsigned short stpr11    : 1;
  unsigned short srpr11    : 1;
  unsigned short tmpr103h  : 1;
  unsigned short iicapr10  : 1;
  unsigned short tmpr100   : 1;
  unsigned short tmpr101   : 1;
  unsigned short tmpr102   : 1;
  unsigned short tmpr103   : 1;
};

struct PR11Lstruct {
  unsigned char stpr11    : 1;
  unsigned char srpr11    : 1;
  unsigned char tmpr103h  : 1;
  unsigned char iicapr10  : 1;
  unsigned char tmpr100   : 1;
  unsigned char tmpr101   : 1;
  unsigned char tmpr102   : 1;
  unsigned char tmpr103   : 1;
};

struct PR11Hstruct {
  unsigned char adpr1     : 1;
  unsigned char rtcpr1    : 1;
  unsigned char itpr1     : 1;
  unsigned char krpr1     : 1;
  unsigned char stpr13    : 1;
  unsigned char srpr13    : 1;
  unsigned char tmpr113   : 1;
  unsigned char tmpr104   : 1;
};

struct MDALstruct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct MULAstruct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct MDAHstruct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct MULBstruct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct MDBHstruct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct MULOHstruct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct MDBLstruct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct MULOLstruct {
  unsigned short bit0      : 1;
  unsigned short bit1      : 1;
  unsigned short bit2      : 1;
  unsigned short bit3      : 1;
  unsigned short bit4      : 1;
  unsigned short bit5      : 1;
  unsigned short bit6      : 1;
  unsigned short bit7      : 1;
  unsigned short bit8      : 1;
  unsigned short bit9      : 1;
  unsigned short bit10     : 1;
  unsigned short bit11     : 1;
  unsigned short bit12     : 1;
  unsigned short bit13     : 1;
  unsigned short bit14     : 1;
  unsigned short bit15     : 1;
};

struct PMCstruct {
  unsigned char maa       : 1;
};

#define P0bits       (*(volatile struct P0struct *)0xFFF00)
#define P1bits       (*(volatile struct P1struct *)0xFFF01)
#define P2bits       (*(volatile struct P2struct *)0xFFF02)
#define P3bits       (*(volatile struct P3struct *)0xFFF03)
#define P4bits       (*(volatile struct P4struct *)0xFFF04)
#define P5bits       (*(volatile struct P5struct *)0xFFF05)
#define P6bits       (*(volatile struct P6struct *)0xFFF06)
#define P7bits       (*(volatile struct P7struct *)0xFFF07)
#define P8bits       (*(volatile struct P8struct *)0xFFF08)
#define P9bits       (*(volatile struct P9struct *)0xFFF09)
#define P10bits      (*(volatile struct P10struct *)0xFFF0A)
#define P11bits      (*(volatile struct P11struct *)0xFFF0B)
#define P12bits      (*(volatile struct P12struct *)0xFFF0C)
#define P13bits      (*(volatile struct P13struct *)0xFFF0D)
#define P14bits      (*(volatile struct P14struct *)0xFFF0E)
#define P15bits      (*(volatile struct P15struct *)0xFFF0F)
#define SDR00bits    (*(volatile struct SDR00struct *)0xFFF10)
#define SIO00bits    (*(volatile struct SIO00struct *)0xFFF10)
#define TXD0bits     (*(volatile struct TXD0struct *)0xFFF10)
#define SDR01bits    (*(volatile struct SDR01struct *)0xFFF12)
#define RXD0bits     (*(volatile struct RXD0struct *)0xFFF12)
#define SIO01bits    (*(volatile struct SIO01struct *)0xFFF12)
#define SDR12bits    (*(volatile struct SDR12struct *)0xFFF14)
#define SIO30bits    (*(volatile struct SIO30struct *)0xFFF14)
#define TXD3bits     (*(volatile struct TXD3struct *)0xFFF14)
#define SDR13bits    (*(volatile struct SDR13struct *)0xFFF16)
#define RXD3bits     (*(volatile struct RXD3struct *)0xFFF16)
#define SIO31bits    (*(volatile struct SIO31struct *)0xFFF16)
#define TDR00bits    (*(volatile struct TDR00struct *)0xFFF18)
#define TDR01bits    (*(volatile struct TDR01struct *)0xFFF1A)
#define TDR01Lbits   (*(volatile struct TDR01Lstruct *)0xFFF1A)
#define TDR01Hbits   (*(volatile struct TDR01Hstruct *)0xFFF1B)
#define ADCRbits     (*(volatile struct ADCRstruct *)0xFFF1E)
#define ADCRHbits    (*(volatile struct ADCRHstruct *)0xFFF1F)
#define PM0bits      (*(volatile struct PM0struct *)0xFFF20)
#define PM1bits      (*(volatile struct PM1struct *)0xFFF21)
#define PM2bits      (*(volatile struct PM2struct *)0xFFF22)
#define PM3bits      (*(volatile struct PM3struct *)0xFFF23)
#define PM4bits      (*(volatile struct PM4struct *)0xFFF24)
#define PM5bits      (*(volatile struct PM5struct *)0xFFF25)
#define PM6bits      (*(volatile struct PM6struct *)0xFFF26)
#define PM7bits      (*(volatile struct PM7struct *)0xFFF27)
#define PM8bits      (*(volatile struct PM8struct *)0xFFF28)
#define PM9bits      (*(volatile struct PM9struct *)0xFFF29)
#define PM10bits     (*(volatile struct PM10struct *)0xFFF2A)
#define PM11bits     (*(volatile struct PM11struct *)0xFFF2B)
#define PM12bits     (*(volatile struct PM12struct *)0xFFF2C)
#define PM14bits     (*(volatile struct PM14struct *)0xFFF2E)
#define PM15bits     (*(volatile struct PM15struct *)0xFFF2F)
#define ADM0bits     (*(volatile struct ADM0struct *)0xFFF30)
#define ADSbits      (*(volatile struct ADSstruct *)0xFFF31)
#define ADM1bits     (*(volatile struct ADM1struct *)0xFFF32)
#define KRMbits      (*(volatile struct KRMstruct *)0xFFF37)
#define EGP0bits     (*(volatile struct EGP0struct *)0xFFF38)
#define EGN0bits     (*(volatile struct EGN0struct *)0xFFF39)
#define EGP1bits     (*(volatile struct EGP1struct *)0xFFF3A)
#define EGN1bits     (*(volatile struct EGN1struct *)0xFFF3B)
#define SDR02bits    (*(volatile struct SDR02struct *)0xFFF44)
#define SIO10bits    (*(volatile struct SIO10struct *)0xFFF44)
#define TXD1bits     (*(volatile struct TXD1struct *)0xFFF44)
#define SDR03bits    (*(volatile struct SDR03struct *)0xFFF46)
#define RXD1bits     (*(volatile struct RXD1struct *)0xFFF46)
#define SIO11bits    (*(volatile struct SIO11struct *)0xFFF46)
#define SDR10bits    (*(volatile struct SDR10struct *)0xFFF48)
#define SIO20bits    (*(volatile struct SIO20struct *)0xFFF48)
#define TXD2bits     (*(volatile struct TXD2struct *)0xFFF48)
#define SDR11bits    (*(volatile struct SDR11struct *)0xFFF4A)
#define RXD2bits     (*(volatile struct RXD2struct *)0xFFF4A)
#define SIO21bits    (*(volatile struct SIO21struct *)0xFFF4A)
#define IICA0bits    (*(volatile struct IICA0struct *)0xFFF50)
#define IICS0bits    (*(volatile struct IICS0struct *)0xFFF51)
#define IICF0bits    (*(volatile struct IICF0struct *)0xFFF52)
#define IICA1bits    (*(volatile struct IICA1struct *)0xFFF54)
#define IICS1bits    (*(volatile struct IICS1struct *)0xFFF55)
#define IICF1bits    (*(volatile struct IICF1struct *)0xFFF56)
#define TDR02bits    (*(volatile struct TDR02struct *)0xFFF64)
#define TDR03bits    (*(volatile struct TDR03struct *)0xFFF66)
#define TDR03Lbits   (*(volatile struct TDR03Lstruct *)0xFFF66)
#define TDR03Hbits   (*(volatile struct TDR03Hstruct *)0xFFF67)
#define TDR04bits    (*(volatile struct TDR04struct *)0xFFF68)
#define TDR05bits    (*(volatile struct TDR05struct *)0xFFF6A)
#define TDR06bits    (*(volatile struct TDR06struct *)0xFFF6C)
#define TDR07bits    (*(volatile struct TDR07struct *)0xFFF6E)
#define TDR10bits    (*(volatile struct TDR10struct *)0xFFF70)
#define TDR11bits    (*(volatile struct TDR11struct *)0xFFF72)
#define TDR11Lbits   (*(volatile struct TDR11Lstruct *)0xFFF72)
#define TDR11Hbits   (*(volatile struct TDR11Hstruct *)0xFFF73)
#define TDR12bits    (*(volatile struct TDR12struct *)0xFFF74)
#define TDR13bits    (*(volatile struct TDR13struct *)0xFFF76)
#define TDR13Lbits   (*(volatile struct TDR13Lstruct *)0xFFF76)
#define TDR13Hbits   (*(volatile struct TDR13Hstruct *)0xFFF77)
#define TDR14bits    (*(volatile struct TDR14struct *)0xFFF78)
#define TDR15bits    (*(volatile struct TDR15struct *)0xFFF7A)
#define TDR16bits    (*(volatile struct TDR16struct *)0xFFF7C)
#define TDR17bits    (*(volatile struct TDR17struct *)0xFFF7E)
#define FLPMCbits    (*(volatile struct FLPMCstruct *)0xFFF80)
#define FLARSbits    (*(volatile struct FLARSstruct *)0xFFF81)
#define FLAPLbits    (*(volatile struct FLAPLstruct *)0xFFF82)
#define FLAPHbits    (*(volatile struct FLAPHstruct *)0xFFF84)
#define FSSQbits     (*(volatile struct FSSQstruct *)0xFFF85)
#define FLSEDLbits   (*(volatile struct FLSEDLstruct *)0xFFF86)
#define FLSEDHbits   (*(volatile struct FLSEDHstruct *)0xFFF88)
#define FLRSTbits    (*(volatile struct FLRSTstruct *)0xFFF89)
#define FSASTLbits   (*(volatile struct FSASTLstruct *)0xFFF8A)
#define FSASTHbits   (*(volatile struct FSASTHstruct *)0xFFF8B)
#define FLWLbits     (*(volatile struct FLWLstruct *)0xFFF8C)
#define FLWHbits     (*(volatile struct FLWHstruct *)0xFFF8E)
#define ITMCbits     (*(volatile struct ITMCstruct *)0xFFF90)
#define SECbits      (*(volatile struct SECstruct *)0xFFF92)
#define MINbits      (*(volatile struct MINstruct *)0x)
#define HOURbits     (*(volatile struct HOURstruct *)0xFFF94)
#define WEEKbits     (*(volatile struct WEEKstruct *)0xFFF95)
#define DAYbits      (*(volatile struct DAYstruct *)0xFFF96)
#define MONTHbits    (*(volatile struct MONTHstruct *)0xFFF97)
#define YEARbits     (*(volatile struct YEARstruct *)0xFFF98)
#define SUBCUDbits   (*(volatile struct SUBCUDstruct *)0xFFF99)
#define ALARMWMbits  (*(volatile struct ALARMWMstruct *)0xFFF9A)
#define ALARMWHbits  (*(volatile struct ALARMWHstruct *)0xFFF9B)
#define ALARMWWbits  (*(volatile struct ALARMWWstruct *)0xFFF9C)
#define RTCC0bits    (*(volatile struct RTCC0struct *)0xFFF9D)
#define RTCC1bits    (*(volatile struct RTCC1struct *)0xFFF9E)
#define CMCbits      (*(volatile struct CMCstruct *)0xFFFA0)
#define CSCbits      (*(volatile struct CSCstruct *)0xFFFA1)
#define OSTCbits     (*(volatile struct OSTCstruct *)0xFFFA2)
#define OSTSbits     (*(volatile struct OSTSstruct *)0xFFFA3)
#define CKCbits      (*(volatile struct CKCstruct *)0xFFFA4)
#define CKS0bits     (*(volatile struct CKS0struct *)0xFFFA5)
#define CKS1bits     (*(volatile struct CKS1struct *)0xFFFA6)
#define RESFbits     (*(volatile struct RESFstruct *)0xFFFA8)
#define LVIMbits     (*(volatile struct LVIMstruct *)0xFFFA9)
#define LVISbits     (*(volatile struct LVISstruct *)0xFFFAA)
#define WDTEbits     (*(volatile struct WDTEstruct *)0xFFFAB)
#define CRCINbits    (*(volatile struct CRCINstruct *)0xFFFAC)
#define RXBbits      (*(volatile struct RXBstruct *)0xFFFAD)
#define TXSbits      (*(volatile struct TXSstruct *)0xFFFAD)
#define MONSTA0bits  (*(volatile struct MONSTA0struct *)0xFFFAE)
#define ASIMbits     (*(volatile struct ASIMstruct *)0xFFFAF)
#define DSA0bits     (*(volatile struct DSA0struct *)0xFFFB0)
#define DSA1bits     (*(volatile struct DSA1struct *)0xFFFB1)
#define DRA0bits     (*(volatile struct DRA0struct *)0xFFFB2)
#define DRA0Lbits    (*(volatile struct DRA0Lstruct *)0xFFFB2)
#define DRA0Hbits    (*(volatile struct DRA0Hstruct *)0xFFFB3)
#define DRA1bits     (*(volatile struct DRA1struct *)0xFFFB4)
#define DRA1Lbits    (*(volatile struct DRA1Lstruct *)0xFFFB4)
#define DRA1Hbits    (*(volatile struct DRA1Hstruct *)0xFFFB5)
#define DBC0bits     (*(volatile struct DBC0struct *)0xFFFB6)
#define DBC0Lbits    (*(volatile struct DBC0Lstruct *)0xFFFB6)
#define DBC0Hbits    (*(volatile struct DBC0Hstruct *)0xFFFB7)
#define DBC1bits     (*(volatile struct DBC1struct *)0xFFFB8)
#define DBC1Lbits    (*(volatile struct DBC1Lstruct *)0xFFFB8)
#define DBC1Hbits    (*(volatile struct DBC1Hstruct *)0xFFFB9)
#define DMC0bits     (*(volatile struct DMC0struct *)0xFFFBA)
#define DMC1bits     (*(volatile struct DMC1struct *)0xFFFBB)
#define DRC0bits     (*(volatile struct DRC0struct *)0xFFFBC)
#define DRC1bits     (*(volatile struct DRC1struct *)0xFFFBD)
#define IF2bits      (*(volatile struct IF2struct *)0xFFFD0)
#define IF2Lbits     (*(volatile struct IF2Lstruct *)0xFFFD0)
#define IF2Hbits     (*(volatile struct IF2Hstruct *)0xFFFD1)
#define IF3bits      (*(volatile struct IF3struct *)0xFFFD2)
#define IF3Lbits     (*(volatile struct IF3Lstruct *)0xFFFD2)
#define MK2bits      (*(volatile struct MK2struct *)0xFFFD4)
#define MK2Lbits     (*(volatile struct MK2Lstruct *)0xFFFD4)
#define MK2Hbits     (*(volatile struct MK2Hstruct *)0xFFFD5)
#define MK3bits      (*(volatile struct MK3struct *)0xFFFD6)
#define MK3Lbits     (*(volatile struct MK3Lstruct *)0xFFFD6)
#define PR02bits     (*(volatile struct PR02struct *)0xFFFD8)
#define PR02Lbits    (*(volatile struct PR02Lstruct *)0xFFFD8)
#define PR02Hbits    (*(volatile struct PR02Hstruct *)0xFFFD9)
#define PR03bits     (*(volatile struct PR03struct *)0xFFFDA)
#define PR03Lbits    (*(volatile struct PR03Lstruct *)0xFFFDA)
#define PR12bits     (*(volatile struct PR12struct *)0xFFFDC)
#define PR12Lbits    (*(volatile struct PR12Lstruct *)0xFFFDC)
#define PR12Hbits    (*(volatile struct PR12Hstruct *)0xFFFDD)
#define PR13bits     (*(volatile struct PR13struct *)0xFFFDE)
#define PR13Lbits    (*(volatile struct PR13Lstruct *)0xFFFDE)
#define IF0bits      (*(volatile struct IF0struct *)0xFFFE0)
#define IF0Lbits     (*(volatile struct IF0Lstruct *)0xFFFE0)
#define IF0Hbits     (*(volatile struct IF0Hstruct *)0xFFFE1)
#define IF1bits      (*(volatile struct IF1struct *)0xFFFE2)
#define IF1Lbits     (*(volatile struct IF1Lstruct *)0xFFFE2)
#define IF1Hbits     (*(volatile struct IF1Hstruct *)0xFFFE3)
#define MK0bits      (*(volatile struct MK0struct *)0xFFFE4)
#define MK0Lbits     (*(volatile struct MK0Lstruct *)0xFFFE4)
#define MK0Hbits     (*(volatile struct MK0Hstruct *)0xFFFE5)
#define MK1bits      (*(volatile struct MK1struct *)0xFFFE6)
#define MK1Lbits     (*(volatile struct MK1Lstruct *)0xFFFE6)
#define MK1Hbits     (*(volatile struct MK1Hstruct *)0xFFFE7)
#define PR00bits     (*(volatile struct PR00struct *)0xFFFE8)
#define PR00Lbits    (*(volatile struct PR00Lstruct *)0xFFFE8)
#define PR00Hbits    (*(volatile struct PR00Hstruct *)0xFFFE9)
#define PR01bits     (*(volatile struct PR01struct *)0xFFFEA)
#define PR01Lbits    (*(volatile struct PR01Lstruct *)0xFFFEA)
#define PR01Hbits    (*(volatile struct PR01Hstruct *)0xFFFEB)
#define PR10bits     (*(volatile struct PR10struct *)0xFFFEC)
#define PR10Lbits    (*(volatile struct PR10Lstruct *)0xFFFEC)
#define PR10Hbits    (*(volatile struct PR10Hstruct *)0xFFFED)
#define PR11bits     (*(volatile struct PR11struct *)0xFFFEE)
#define PR11Lbits    (*(volatile struct PR11Lstruct *)0xFFFEE)
#define PR11Hbits    (*(volatile struct PR11Hstruct *)0xFFFEF)
#define MDALbits     (*(volatile struct MDALstruct *)0xFFFF0)
#define MULAbits     (*(volatile struct MULAstruct *)0xFFFF0)
#define MDAHbits     (*(volatile struct MDAHstruct *)0xFFFF2)
#define MULBbits     (*(volatile struct MULBstruct *)0xFFFF2)
#define MDBHbits     (*(volatile struct MDBHstruct *)0xFFFF4)
#define MULOHbits    (*(volatile struct MULOHstruct *)0xFFFF4)
#define MDBLbits     (*(volatile struct MDBLstruct *)0xFFFF6)
#define MULOLbits    (*(volatile struct MULOLstruct *)0xFFFF6)
#define PMCbits      (*(volatile struct PMCstruct *)0xFFFFE)

