contiki-os/contiki/cpu/rl78/sfrs.h
/* Named Register bits: */
#define ADCE      (ADM0bits.adce)
#define ADCS      (ADM0bits.adcs)
#define SPD0      (IICS0bits.spd0)
#define STD0      (IICS0bits.std0)
#define ACKD0     (IICS0bits.ackd0)
#define TRC0      (IICS0bits.trc0)
#define COI0      (IICS0bits.coi0)
#define EXC0      (IICS0bits.exc0)
#define ALD0      (IICS0bits.ald0)
#define MSTS0     (IICS0bits.msts0)
#define IICRSV0   (IICF0bits.iicrsv0)
#define STCEN0    (IICF0bits.stcen0)
#define IICBSY0   (IICF0bits.iicbsy0)
#define STCF0     (IICF0bits.stcf0)
#define SPD1      (IICS1bits.spd1)
#define STD1      (IICS1bits.std1)
#define ACKD1     (IICS1bits.ackd1)
#define TRC1      (IICS1bits.trc1)
#define COI1      (IICS1bits.coi1)
#define EXC1      (IICS1bits.exc1)
#define ALD1      (IICS1bits.ald1)
#define MSTS1     (IICS1bits.msts1)
#define IICRSV1   (IICF1bits.iicrsv1)
#define STCEN1    (IICF1bits.stcen1)
#define IICBSY1   (IICF1bits.iicbsy1)
#define STCF1     (IICF1bits.stcf1)
#define FSSTP     (FSSQbits.fsstp)
#define SQST      (FSSQbits.sqst)
#define SQEND     (FSASTHbits.sqend)
#define ESQEND    (FSASTHbits.esqend)
#define RCLOE1    (RTCC0bits.rcloe1)
#define RTCE      (RTCC0bits.rtce)
#define RWAIT     (RTCC1bits.rwait)
#define RWST      (RTCC1bits.rwst)
#define RIFG      (RTCC1bits.rifg)
#define WAFG      (RTCC1bits.wafg)
#define WALIE     (RTCC1bits.walie)
#define WALE      (RTCC1bits.wale)
#define HIOSTOP   (CSCbits.hiostop)
#define XTSTOP    (CSCbits.xtstop)
#define MSTOP     (CSCbits.mstop)
#define SDIV      (CKCbits.sdiv)
#define MCM0      (CKCbits.mcm0)
#define MCS       (CKCbits.mcs)
#define CSS       (CKCbits.css)
#define CLS       (CKCbits.cls)
#define PCLOE0    (CKS0bits.pcloe0)
#define PCLOE1    (CKS1bits.pcloe1)
#define LVIF      (LVIMbits.lvif)
#define LVIOMSK   (LVIMbits.lviomsk)
#define LVISEN    (LVIMbits.lvisen)
#define LVILV     (LVISbits.lvilv)
#define LVIMD     (LVISbits.lvimd)
#define DWAIT0    (DMC0bits.dwait0)
#define DS0       (DMC0bits.ds0)
#define DRS0      (DMC0bits.drs0)
#define STG0      (DMC0bits.stg0)
#define DWAIT1    (DMC1bits.dwait1)
#define DS1       (DMC1bits.ds1)
#define DRS1      (DMC1bits.drs1)
#define STG1      (DMC1bits.stg1)
#define DST0      (DRC0bits.dst0)
#define DEN0      (DRC0bits.den0)
#define DST1      (DRC1bits.dst1)
#define DEN1      (DRC1bits.den1)
#define TMIF05    (IF2Lbits.tmif05)
#define TMIF06    (IF2Lbits.tmif06)
#define TMIF07    (IF2Lbits.tmif07)
#define PIF6      (IF2Lbits.pif6)
#define PIF7      (IF2Lbits.pif7)
#define PIF8      (IF2Lbits.pif8)
#define PIF9      (IF2Lbits.pif9)
#define PIF10     (IF2Lbits.pif10)
#define PIF11     (IF2Hbits.pif11)
#define TMIF10    (IF2Hbits.tmif10)
#define TMIF11    (IF2Hbits.tmif11)
#define TMIF12    (IF2Hbits.tmif12)
#define TMIF13H   (IF2Hbits.tmif13h)
#define MDIF      (IF2Hbits.mdif)
#define IICAIF1   (IF2Hbits.iicaif1)
#define FLIF      (IF2Hbits.flif)
#define DMAIF2    (IF3Lbits.dmaif2)
#define DMAIF3    (IF3Lbits.dmaif3)
#define TMIF14    (IF3Lbits.tmif14)
#define TMIF15    (IF3Lbits.tmif15)
#define TMIF16    (IF3Lbits.tmif16)
#define TMIF17    (IF3Lbits.tmif17)
#define TMMK05    (MK2Lbits.tmmk05)
#define TMMK06    (MK2Lbits.tmmk06)
#define TMMK07    (MK2Lbits.tmmk07)
#define PMK6      (MK2Lbits.pmk6)
#define PMK7      (MK2Lbits.pmk7)
#define PMK8      (MK2Lbits.pmk8)
#define PMK9      (MK2Lbits.pmk9)
#define PMK10     (MK2Lbits.pmk10)
#define PMK11     (MK2Hbits.pmk11)
#define TMMK10    (MK2Hbits.tmmk10)
#define TMMK11    (MK2Hbits.tmmk11)
#define TMMK12    (MK2Hbits.tmmk12)
#define TMMK13H   (MK2Hbits.tmmk13h)
#define MDMK      (MK2Hbits.mdmk)
#define IICAMK1   (MK2Hbits.iicamk1)
#define FLMK      (MK2Hbits.flmk)
#define DMAMK2    (MK3Lbits.dmamk2)
#define DMAMK3    (MK3Lbits.dmamk3)
#define TMMK14    (MK3Lbits.tmmk14)
#define TMMK15    (MK3Lbits.tmmk15)
#define TMMK16    (MK3Lbits.tmmk16)
#define TMMK17    (MK3Lbits.tmmk17)
#define TMPR005   (PR02Lbits.tmpr005)
#define TMPR006   (PR02Lbits.tmpr006)
#define TMPR007   (PR02Lbits.tmpr007)
#define PPR06     (PR02Lbits.ppr06)
#define PPR07     (PR02Lbits.ppr07)
#define PPR08     (PR02Lbits.ppr08)
#define PPR09     (PR02Lbits.ppr09)
#define PPR010    (PR02Lbits.ppr010)
#define PPR011    (PR02Hbits.ppr011)
#define TMPR010   (PR02Hbits.tmpr010)
#define TMPR011   (PR02Hbits.tmpr011)
#define TMPR012   (PR02Hbits.tmpr012)
#define TMPR013H  (PR02Hbits.tmpr013h)
#define MDPR0     (PR02Hbits.mdpr0)
#define IICAPR01  (PR02Hbits.iicapr01)
#define FLPR0     (PR02Hbits.flpr0)
#define DMAPR02   (PR03Lbits.dmapr02)
#define DMAPR03   (PR03Lbits.dmapr03)
#define TMPR014   (PR03Lbits.tmpr014)
#define TMPR015   (PR03Lbits.tmpr015)
#define TMPR016   (PR03Lbits.tmpr016)
#define TMPR017   (PR03Lbits.tmpr017)
#define TMPR105   (PR12Lbits.tmpr105)
#define TMPR106   (PR12Lbits.tmpr106)
#define TMPR107   (PR12Lbits.tmpr107)
#define PPR16     (PR12Lbits.ppr16)
#define PPR17     (PR12Lbits.ppr17)
#define PPR18     (PR12Lbits.ppr18)
#define PPR19     (PR12Lbits.ppr19)
#define PPR110    (PR12Lbits.ppr110)
#define PPR111    (PR12Hbits.ppr111)
#define TMPR110   (PR12Hbits.tmpr110)
#define TMPR111   (PR12Hbits.tmpr111)
#define TMPR112   (PR12Hbits.tmpr112)
#define TMPR113H  (PR12Hbits.tmpr113h)
#define MDPR1     (PR12Hbits.mdpr1)
#define IICAPR11  (PR12Hbits.iicapr11)
#define FLPR1     (PR12Hbits.flpr1)
#define DMAPR12   (PR13Lbits.dmapr12)
#define DMAPR13   (PR13Lbits.dmapr13)
#define TMPR114   (PR13Lbits.tmpr114)
#define TMPR115   (PR13Lbits.tmpr115)
#define TMPR116   (PR13Lbits.tmpr116)
#define TMPR117   (PR13Lbits.tmpr117)
#define WDTIIF    (IF0Lbits.wdtiif)
#define LVIIF     (IF0Lbits.lviif)
#define PIF0      (IF0Lbits.pif0)
#define PIF1      (IF0Lbits.pif1)
#define PIF2      (IF0Lbits.pif2)
#define PIF3      (IF0Lbits.pif3)
#define PIF4      (IF0Lbits.pif4)
#define PIF5      (IF0Lbits.pif5)
#define STIF2     (IF0Hbits.stif2)
#define SRIF2     (IF0Hbits.srif2)
#define TMIF11H   (IF0Hbits.tmif11h)
#define DMAIF0    (IF0Hbits.dmaif0)
#define DMAIF1    (IF0Hbits.dmaif1)
#define STIF0     (IF0Hbits.stif0)
#define SRIF0     (IF0Hbits.srif0)
#define TMIF01H   (IF0Hbits.tmif01h)
#define SREIF0    (IF0Hbits.tmif01h)
#define STIF1     (IF1Lbits.stif1)
#define SRIF1     (IF1Lbits.srif1)
#define TMIF03H   (IF1Lbits.tmif03h)
#define IICAIF0   (IF1Lbits.iicaif0)
#define TMIF00    (IF1Lbits.tmif00)
#define TMIF01    (IF1Lbits.tmif01)
#define TMIF02    (IF1Lbits.tmif02)
#define TMIF03    (IF1Lbits.tmif03)
#define ADIF      (IF1Hbits.adif)
#define RTCIF     (IF1Hbits.rtcif)
#define ITIF      (IF1Hbits.itif)
#define KRIF      (IF1Hbits.krif)
#define STIF3     (IF1Hbits.stif3)
#define SRIF3     (IF1Hbits.srif3)
#define TMIF13    (IF1Hbits.tmif13)
#define TMIF04    (IF1Hbits.tmif04)
#define WDTIMK    (MK0Lbits.wdtimk)
#define LVIMK     (MK0Lbits.lvimk)
#define PMK0      (MK0Lbits.pmk0)
#define PMK1      (MK0Lbits.pmk1)
#define PMK2      (MK0Lbits.pmk2)
#define PMK3      (MK0Lbits.pmk3)
#define PMK4      (MK0Lbits.pmk4)
#define PMK5      (MK0Lbits.pmk5)
#define STMK2     (MK0Hbits.stmk2)
#define SRMK2     (MK0Hbits.srmk2)
#define TMMK11H   (MK0Hbits.tmmk11h)
#define DMAMK0    (MK0Hbits.dmamk0)
#define DMAMK1    (MK0Hbits.dmamk1)
#define STMK0     (MK0Hbits.stmk0)
#define SRMK0     (MK0Hbits.srmk0)
#define TMMK01H   (MK0Hbits.tmmk01h)
#define SREMK0    (MK0Hbits.tmmk01h)
#define STMK1     (MK1Lbits.stmk1)
#define SRMK1     (MK1Lbits.srmk1)
#define TMMK03H   (MK1Lbits.tmmk03h)
#define IICAMK0   (MK1Lbits.iicamk0)
#define TMMK00    (MK1Lbits.tmmk00)
#define TMMK01    (MK1Lbits.tmmk01)
#define TMMK02    (MK1Lbits.tmmk02)
#define TMMK03    (MK1Lbits.tmmk03)
#define ADMK      (MK1Hbits.admk)
#define RTCMK     (MK1Hbits.rtcmk)
#define ITMK      (MK1Hbits.itmk)
#define KRMK      (MK1Hbits.krmk)
#define STMK3     (MK1Hbits.stmk3)
#define SRMK3     (MK1Hbits.srmk3)
#define TMMK13    (MK1Hbits.tmmk13)
#define TMMK04    (MK1Hbits.tmmk04)
#define WDTIPR0   (PR00Lbits.wdtipr0)
#define LVIPR0    (PR00Lbits.lvipr0)
#define PPR00     (PR00Lbits.ppr00)
#define PPR01     (PR00Lbits.ppr01)
#define PPR02     (PR00Lbits.ppr02)
#define PPR03     (PR00Lbits.ppr03)
#define PPR04     (PR00Lbits.ppr04)
#define PPR05     (PR00Lbits.ppr05)
#define STPR02    (PR00Hbits.stpr02)
#define SRPR02    (PR00Hbits.srpr02)
#define TMPR011H  (PR00Hbits.tmpr011h)
#define DMAPR00   (PR00Hbits.dmapr00)
#define DMAPR01   (PR00Hbits.dmapr01)
#define STPR00    (PR00Hbits.stpr00)
#define SRPR00    (PR00Hbits.srpr00)
#define TMPR001H  (PR00Hbits.tmpr001h)
#define SREPR00   (PR00Hbits.tmpr001h)
#define STPR01    (PR01Lbits.stpr01)
#define SRPR01    (PR01Lbits.srpr01)
#define TMPR003H  (PR01Lbits.tmpr003h)
#define IICAPR00  (PR01Lbits.iicapr00)
#define TMPR000   (PR01Lbits.tmpr000)
#define TMPR001   (PR01Lbits.tmpr001)
#define TMPR002   (PR01Lbits.tmpr002)
#define TMPR003   (PR01Lbits.tmpr003)
#define ADPR0     (PR01Hbits.adpr0)
#define RTCPR0    (PR01Hbits.rtcpr0)
#define ITPR0     (PR01Hbits.itpr0)
#define KRPR0     (PR01Hbits.krpr0)
#define STPR03    (PR01Hbits.stpr03)
#define SRPR03    (PR01Hbits.srpr03)
#define TMPR013   (PR01Hbits.tmpr013)
#define TMPR004   (PR01Hbits.tmpr004)
#define WDTIPR1   (PR10Lbits.wdtipr1)
#define LVIPR1    (PR10Lbits.lvipr1)
#define PPR10     (PR10Lbits.ppr10)
#define PPR11     (PR10Lbits.ppr11)
#define PPR12     (PR10Lbits.ppr12)
#define PPR13     (PR10Lbits.ppr13)
#define PPR14     (PR10Lbits.ppr14)
#define PPR15     (PR10Lbits.ppr15)
#define STPR12    (PR10Hbits.stpr12)
#define SRPR12    (PR10Hbits.srpr12)
#define TMPR111H  (PR10Hbits.tmpr111h)
#define DMAPR10   (PR10Hbits.dmapr10)
#define DMAPR11   (PR10Hbits.dmapr11)
#define STPR10    (PR10Hbits.stpr10)
#define SRPR10    (PR10Hbits.srpr10)
#define TMPR101H  (PR10Hbits.tmpr101h)
#define SREPR10   (PR10Hbits.tmpr101h)
#define STPR11    (PR11Lbits.stpr11)
#define SRPR11    (PR11Lbits.srpr11)
#define TMPR103H  (PR11Lbits.tmpr103h)
#define IICAPR10  (PR11Lbits.iicapr10)
#define TMPR100   (PR11Lbits.tmpr100)
#define TMPR101   (PR11Lbits.tmpr101)
#define TMPR102   (PR11Lbits.tmpr102)
#define TMPR103   (PR11Lbits.tmpr103)
#define ADPR1     (PR11Hbits.adpr1)
#define RTCPR1    (PR11Hbits.rtcpr1)
#define ITPR1     (PR11Hbits.itpr1)
#define KRPR1     (PR11Hbits.krpr1)
#define STPR13    (PR11Hbits.stpr13)
#define SRPR13    (PR11Hbits.srpr13)
#define TMPR113   (PR11Hbits.tmpr113)
#define TMPR104   (PR11Hbits.tmpr104)
#define MAA       (PMCbits.maa)

#endif /* SFRS_H */
